In [1]:
import pandas as pd
import numpy as np
import plotly.express as px
import plotly.graph_objects as go
import matplotlib.pyplot as plt
from datetime import datetime

In [2]:
data = pd.read_csv('C:/Users/migue/Desktop/data_preprocess.csv')

In [3]:
data.head()

,Unnamed: 0,ProductFamily_ID,ProductCategory_ID,ProductBrand_ID,ProductName_ID,ProductPackSKU_ID,Point-of-Sale_ID,Date,Value,Day of the Week,Quarter,Units
0,1,16,11,306,649,1970,1,2017-03-04,1540.0,5,1,2.0
1,3,16,11,306,649,1970,1,2016-05-02,3080.0,0,2,4.0
2,5,16,11,306,649,1970,1,2016-10-24,1540.0,0,4,2.0
3,9,16,11,306,649,1970,1,2017-10-13,1620.0,4,4,2.0
4,10,16,11,306,649,1970,1,2017-10-14,1620.0,5,4,2.0

In [4]:
data['TID']=data['ProductFamily_ID'].astype(str)+data['Point-of-Sale_ID'].astype(str)+data['Date'].astype(str)

In [5]:
data.head(3)

,Unnamed: 0,ProductFamily_ID,ProductCategory_ID,ProductBrand_ID,ProductName_ID,ProductPackSKU_ID,Point-of-Sale_ID,Date,Value,Day of the Week,Quarter,Units,TID
0,1,16,11,306,649,1970,1,2017-03-04,1540.0,5,1,2.0,1612017-03-04
1,3,16,11,306,649,1970,1,2016-05-02,3080.0,0,2,4.0,1612016-05-02
2,5,16,11,306,649,1970,1,2016-10-24,1540.0,0,4,2.0,1612016-10-24

In [6]:
df=data.copy()

In [ ]:
df.groupby(['Metadata_A','treatment'],as_index=False).agg({'TID':'mean','ratio':'first'})

In [9]:
df[['ProductFamily_ID','Point-of-Sale_ID','Date','Units']].groupby('TID').mean()

       ProductFamily_ID  Point-of-Sale_ID
Units
1.0           11.029889        201.659233
2.0           10.110862        201.651666
3.0            9.347231        202.580206
4.0            9.184699        199.058200
5.0            8.969833        201.544803
...                 ...               ...
265.0         16.000000         78.000000
269.0         15.000000         78.000000
274.0         21.000000         72.000000
277.0         21.000000         72.000000
287.0         18.000000        401.000000

[178 rows x 2 columns]

In [12]:
len(df['TID'].unique())

8250720

In [13]:
df2 = df.groupby(['ProductFamily_ID','Point-of-Sale_ID','Date','TID'],as_index=False)['Units'].mean()

In [14]:
df2.head(3)

   ProductFamily_ID  Point-of-Sale_ID        Date           TID     Units
0                 1                 1  2016-01-01  112016-01-01  2.000000
1                 1                 1  2016-01-02  112016-01-02  3.263158
2                 1                 1  2016-01-03  112016-01-03  2.000000

In [17]:
df2.groupby('Point-of-Sale_ID')['Units'].sum().sort_values(ascending=False)

Point-of-Sale_ID
292    131072.176340
78     103037.598029
72      98015.797154
280     96837.487467
333     95737.015534
           ...
366     25518.077673
365     25249.526195
373     24605.671016
221     24220.424577
243     19760.654861
Name: Units, Length: 410, dtype: float64